Octopus/Documents/vrgПоступлениеМобильное.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>vrgПоступлениеМобильное</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображениеДобавлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазовыеЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоСериям</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Octopus/Documents/vrgПоступлениеМобильное/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ЗаполнитьДополнительныеДанныеВТоварахНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеДанныеВТоварахНаСервере()

	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		СтрокаТовары.Остаток = Разработка.ПолучитьОстаток(СтрокаТовары.Номенклатура, Объект.Склад, СтрокаТовары.СерияНоменклатуры, СтрокаТовары.ХарактеристикаНоменклатуры, СтрокаТовары.ЕдиницаИзмерения);
		//СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоЗаказ И СтрокаТовары.КоличествоЗаказ > 0);
		//СтрокаТовары.Артикул = СтрокаТовары.Номенклатура.Артикул;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.КоличествоЗаказ = 0;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ОбновитьАртикулНоменклатуры", Истина);
	ОбработатьСтрокуТабличнойЧастиНоменклатуры(ТекущиеДанные.ПолучитьИдентификатор(), СтруктураДействий);

КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)

	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШтрихкодаНаКлиенте()

	ТекущаяСтрока = Неопределено;
	Модифицированность = Истина;
	Если НЕ ЗначениеЗаполнено(СокрЛП(Штрихкод)) Тогда
		Возврат;
	КонецЕсли;
	ОбработатьВводШтрихкодаНаСервере();

	Если РучнойВводКоличества И ШтрихкодНайден Тогда
		ТекущийЭлемент = Элементы.Номенклатура;
		ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", , ЭтотОбъект);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбработатьВводШтрихкодаНаСервере()

	ВыборкаШтрихкода = Разработка.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	ШтрихкодНайден = (ВыборкаШтрихкода.Количество() <> 0);
	Если ВыборкаШтрихкода.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШтрихкода, , "Штрихкод");
		//МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, СерияНоменклатуры", Номенклатура, СерияНоменклатуры));
		//Если МассивСтрок.Количество() = 0 Тогда
		//	Возврат Ложь;
		Если НЕ РучнойВводКоличества Тогда
			ДобавитьОбработатьСтрокуТоваров();
		КонецЕсли;
	Иначе
		Сообщить("По штрихкоду """ + СокрЛП(Штрихкод) + """ не знайдено жодного товару!");
	КонецЕсли;

	Штрихкод = "";

	Возврат Истина;

КонецФункции

&НаСервере
Процедура ДобавитьОбработатьСтрокуТоваров()

	МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения));
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаТовары = МассивСтрок[0];
	Иначе
		СтрокаТовары = Объект.Товары.Вставить(0);
		//СтрокаТовары.Артикул = Номенклатура.Артикул;
		СтрокаТовары.Остаток = Разработка.ПолучитьОстаток(Номенклатура, Объект.Склад, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
	КонецЕсли;
	СтрокаТовары.Номенклатура = Номенклатура;
	СтрокаТовары.СерияНоменклатуры = СерияНоменклатуры;
	СтрокаТовары.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	СтрокаТовары.ЕдиницаИзмерения = ЕдиницаИзмерения;
	СтрокаТовары.Коэффициент = Коэффициент;
	СтрокаТовары.Количество = СтрокаТовары.Количество + ?(РучнойВводКоличества, РучноеКоличество, 1);
	СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоЗаказ И СтрокаТовары.КоличествоЗаказ > 0);
	Количество = СтрокаТовары.Количество;
	КоличествоЗаказ = СтрокаТовары.КоличествоЗаказ;
	ТекущаяСтрока = СтрокаТовары.ПолучитьИдентификатор();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьДополнительныеДанныеВТоварахНаСервере();

	РежимОбновленияКартинок = Константы.РежимОбновленияКартинок.Получить();

	УправлениеФормамиСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуТабличнойЧастиНоменклатуры(ИдентификаторСтроки, СтруктураДействий)

	СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтруктураДействий.Свойство("ОбновитьАртикулНоменклатуры") Тогда
		//СтрокаТовары.Артикул = СтрокаТовары.Номенклатура.Артикул;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.ЗаказПоставщику) Тогда
		Сообщить("Не вказано Замовлення постачальнику!");
		Возврат;
	КонецЕсли;

	Если Объект.Товары.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ТекстВопроса = "Табличну частину товарів буде перезаповнено. Продовжити?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ЗаполнитьПоЗаказуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказуНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ЗаказПоставщику);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоЗаказуНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	// для того, чтобы точно клавиатура пряталась или открывалась
	//Если ТекущаяСтраница = Элементы.СтраницаСканирование Тогда
	//	ТекущийЭлемент = Элементы.Штрихкод;
	//	НачатьРедактированиеЭлемента();
	//Иначе
	//	//ТекущийЭлемент = Элементы["ДекорацияДляФокусировки" + ТекущаяСтраница.Имя];
	//	//НачатьРедактированиеЭлемента()
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ЗаказПоставщику) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ТекстВопроса = "Заповнити документ надходження за обраним замовленням постачальнику?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//ПланыОбмена.ЗарегистрироватьИзменения(Константы.УзелЦентральнойБазы.Получить(), Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Записать();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если ОткрытаФормаРедактированияНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	Если ФормаДокументаЗаблокирована Тогда
		Возврат;
	КонецЕсли;

	Если Событие = "UniversalBroadcastEvent" и Источник = глНомерУстройства Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Данные);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		МассивЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("FilterData");
		Если МассивЭлементов.Количество() Тогда
			Штрихкод = МассивЭлементов[0].ТекстовоеСодержимое;
			ОбработатьВводШтрихкодаНаКлиенте();
		КонецЕсли;
		//Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
		//	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		//	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;
		//КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросДобавлятьНовуюСтрокуТоваровЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если РучнойВводКоличества Тогда
			//ТекущийЭлемент = Элементы.Номенклатура;
			ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", , ЭтотОбъект);
			Возврат;
		Иначе
			ДобавитьОбработатьСтрокуТоваров();
			//Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
			//	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
			//	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если НажатаКомандаСканированияЧерезКамеру Тогда
		ЗапуститьСканированиеЧерезКамеруУстройства();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрыНоменклатуры(Команда)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Сообщить("У поточному рядку не вказана номенклатура");
		Возврат;
	КонецЕсли;

	ОписаниеОповещенияОЗакрытииРедактированияНоменклатуры = Новый ОписаниеОповещения("ЗакрытиеРедактированияНоменклатуры", ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Ключ, ИдентификаторСтроки, ИзменениеПараметровНоменклатуры",
						ТекущиеДанные.Номенклатура, Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор(), Истина), ЭтаФорма,
						, , , ОписаниеОповещенияОЗакрытииРедактированияНоменклатуры);
	ОткрытаФормаРедактированияНоменклатуры = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеРедактированияНоменклатуры(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ОткрытаФормаРедактированияНоменклатуры = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура СканироватьЧерезКамеруУстройства(Команда)

	НажатаКомандаСканированияЧерезКамеру = Истина;
	ЗапуститьСканированиеЧерезКамеруУстройства();

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСканированиеЧерезКамеруУстройства()

	ИдетСканированиеЧерезКамеру = Истина;
	РучнойВводКоличества = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
	ОбработчикСканирования = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗавершение", ЭтаФорма);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗакрытие", ЭтаФорма);
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(, ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Линейный);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОстановитьСканированиеЧерезКамеруУстройства()

	Если ИдетСканированиеЧерезКамеру Тогда
		ПрограммноеЗакрытиеСканированияЧерезКамеру = Истина;
		#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		ИдетСканированиеЧерезКамеру = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗавершение(ОтсканированныйШтрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт

	Штрихкод = СокрЛП(ОтсканированныйШтрихкод);
	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗакрытие(ДополнительныеПараметры) Экспорт

	Если НЕ ПрограммноеЗакрытиеСканированияЧерезКамеру Тогда
		НажатаКомандаСканированияЧерезКамеру = Ложь;
	КонецЕсли;
	ПрограммноеЗакрытиеСканированияЧерезКамеру = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура СкрыватьОтсканированныеПриИзменении(Элемент)

	Элементы.Товары.ОтборСтрок = Неопределено;
	Если СкрыватьОтсканированные Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Отсканировано", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	СтрокаТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоЗаказ И СтрокаТовары.КоличествоЗаказ > 0);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	ПодключитьОбработчикАвтосохранения();

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикАвтосохранения()

	Если ИспользоватьАвтосохранение <> Истина
		ИЛИ ИнтервалАвтосохранения = 0 Тогда
			Возврат;
	КонецЕсли;

	ПодключитьОбработчикОжидания("ВыполнитьАвтосохранениеДокумента", ИнтервалАвтосохранения);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтосохранениеДокумента() Экспорт

	Автосохранение = Истина;
	Попытка
		Записать();
	Исключение
	КонецПопытки;
	Автосохранение = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	КонтрагентПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	ОсновнойДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговорКонтрагента;
	Если ОсновнойДоговорКонтрагента.Организация = Объект.Организация Тогда
		Объект.ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;
	ОткрытьФормуВыбораСтрокиТовара(Истина, Копирование);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	ОткрытьФормуВыбораСтрокиТовара(, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтрокиТовара(Добавление = Ложь, Копирование = Ложь)

	СтруктураСтрокаТовары = ПолучитьСтруктуруСтрокиТабЧастиТовары(Добавление, Копирование);
	ПараметрыФормы = Новый Структура("СтруктураСтрокаТовары", СтруктураСтрокаТовары);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтрокиТовара", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЦветСтроки(СтрокаТабличнойЧасти)

	ЦветФонаСтроки = Новый Цвет;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат ЦветФонаСтроки;
	КонецЕсли;

	//Если СтрокаТабличнойЧасти.КоличествоЗаказ <> 0 И СтрокаТабличнойЧасти.КоличествоЗаказ <> СтрокаТабличнойЧасти.Количество И СтрокаТабличнойЧасти.Количество <> 0 Тогда
	//	ЦветФонаСтроки = WebЦвета.Розовый;
	//ИначеЕсли СтрокаТабличнойЧасти.КоличествоЗаказ <> 0 И СтрокаТабличнойЧасти.КоличествоЗаказ = СтрокаТабличнойЧасти.Количество Тогда
	//	ЦветФонаСтроки = WebЦвета.БледноЗеленый;
	//ИначеЕсли СтрокаТабличнойЧасти.КоличествоЗаказ = 0 И СтрокаТабличнойЧасти.Количество <> 0 Тогда
	//	ЦветФонаСтроки = WebЦвета.СветлоЗолотистый;
	//КонецЕсли;

	Возврат ЦветФонаСтроки;

КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруСтрокиТабЧастиТовары(ЭтоДобавление = Ложь, ЗаполнитьТекущимиДанными = Ложь)

	СтруктураСтроки = Новый Структура("НомерСтроки, Артикул, Номенклатура, Количество, Остаток, ЕдиницаИзмерения, Коэффициент, Цена, Сумма, СерияНоменклатуры, ХарактеристикаНоменклатуры");
	ЦветФонаСтроки = Новый Цвет;
	Если ЗаполнитьТекущимиДанными Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные);
		ЦветФонаСтроки = ПолучитьЦветСтроки(ТекущиеДанные);
	КонецЕсли;
	Если ЭтоДобавление Тогда
		СтруктураСтроки.НомерСтроки = Объект.Товары.Количество() + 1;
	КонецЕсли;
	СтруктураСтроки.Вставить("РежимОбновленияКартинок", РежимОбновленияКартинок);
	СтруктураСтроки.Вставить("ЦветФонаСтроки", ЦветФонаСтроки);
	СтруктураСтроки.Вставить("Склад", Объект.Склад);
	//СтруктураСтроки.Вставить("ТипЦен", Объект.ТипЦен);

	Возврат СтруктураСтроки;

КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВводаКоличества" Тогда
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Число") ИЛИ НЕ ВыбранноеЗначение > 0 Тогда
			Возврат;
		КонецЕсли;
		РучноеКоличество = ВыбранноеЗначение;
		ДобавитьОбработатьСтрокуТоваров();
		//ТекущийЭлемент = Элементы.Штрихкод;
		//#Если МобильноеПриложениеКлиент Тогда
		//НачатьРедактированиеЭлемента();
		//#КонецЕсли

	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВыбораСтрокиТовара" Тогда

		Модифицированность = Истина;
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ВыбранноеЗначение.НомерСтроки > Объект.Товары.Количество() Тогда
			ТекущиеДанные = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
		Иначе
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
		КонецЕсли;
		ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
		Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	УправлениеФормамиКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если Автосохранение Тогда
		Возврат;
	КонецЕсли;

	УправлениеФормамиСервер.ОбработкаПроверкиЗаполненияДокументов(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры
